{
  "1": "The fog-shrouded Court of Chancery and the endless Jarndyce lawsuit are introduced",
  "2": "At Chesney Wold, Lady Dedlock has a mysterious reaction to a legal document",
  "3": "Esther Summerson narrates her loveless childhood and journey to a new life",
  "4": "Three young wards meet and spend a chaotic night at the philanthropic Jellyby household",
  "5": "The journey to Bleak House brings new friendships and a warm welcome",
  "6": "Life settles into happiness at Bleak House as Richard chooses a profession",
  "7": "The Ghost's Walk legend hints at coming disgrace for the Dedlock family",
  "8": "Mr. Tulkinghorn investigates the mysterious law-writer whose handwriting affected Lady Dedlock",
  "9": "Esther and Ada witness both false and true charity among London's poor",
  "10": "The law-writer Nemo is found dead, and a veiled lady visits his grave",
  "11": "Nemo's pauper burial reveals society's callousness toward the poor",
  "12": "Mr. Bucket investigates the veiled lady who visited Nemo's grave",
  "13": "Richard abandons medicine for law as Esther's group encounters the homeless Jo",
  "14": "Caddy Jellyby announces her engagement to a dancing master",
  "15": "Esther discovers the orphaned Neckett children living in poverty",
  "16": "Tom-all-Alone's slum shows Chancery's destructive legacy spreading disease and despair",
  "17": "Time passes at Bleak House as Richard's restlessness grows",
  "18": "Lady Dedlock's anxiety deepens as Mr. Guppy discovers dangerous information",
  "19": "Jo is constantly forced to 'move on' through London's streets",
  "20": "Ex-soldier Mr. George faces pressure over letters from the past",
  "21": "The grotesque Smallweed family schemes over valuable documents",
  "22": "Mr. Bucket continues investigating as Jo remains sick and hunted",
  "23": "Mr. Guppy proposes to Esther while Richard's instability worsens",
  "24": "Richard hires the parasitic lawyer Vholes and becomes consumed by the lawsuit",
  "25": "Mrs. Snagsby's baseless jealousy creates domestic chaos",
  "26": "Mr. George struggles between honor and financial ruin at his shooting gallery",
  "27": "George reunites with his mother at Chesney Wold after years away",
  "28": "Class tensions arise when an ironmaster's son wishes to court Lady Dedlock's maid",
  "29": "Lady Dedlock learns that Mr. Guppy knows her terrible secret",
  "30": "Esther compassionately cares for sick Jo and contracts smallpox",
  "31": "Esther recovers from smallpox but must face her disfigurement",
  "32": "Tulkinghorn confronts Lady Dedlock with his knowledge and traps her in silence",
  "33": "Life continues at Chesney Wold while Lady Dedlock lives in fear",
  "34": "Various investigations and schemes tighten around the characters",
  "35": "Esther sees her scarred face and accepts Mr. Jarndyce's protective marriage proposal",
  "36": "Chesney Wold maintains its aristocratic calm before the coming storm",
  "37": "Richard's complete obsession with the lawsuit destroys his health and judgment",
  "38": "Ada reveals she has secretly married Richard despite his ruin",
  "39": "Mr. Tulkinghorn is found murdered and George is arrested",
  "40": "News of the murder reaches Chesney Wold as suspicion falls on Lady Dedlock",
  "41": "The murder investigation continues at Tulkinghorn's chambers",
  "42": "Various parties search for evidence in the murder case",
  "43": "Esther prepares for marriage while learning Ada is pregnant",
  "44": "Lady Dedlock writes confession letters and flees in despair",
  "45": "Mr. Bucket gathers final evidence in his investigation",
  "46": "The real murderer is revealed to be Hortense, Lady Dedlock's former maid",
  "47": "Jo dies at the shooting gallery, unable to say the Lord's Prayer",
  "48": "Sir Leicester learns the truth but Lady Dedlock has already fled",
  "49": "Mr. Bucket and Esther desperately pursue Lady Dedlock to save her",
  "50": "The search for Lady Dedlock intensifies as they follow her trail",
  "51": "Sir Leicester suffers a stroke but his love for his wife remains unchanged",
  "52": "Sir Leicester tries to communicate his forgiveness while the search continues",
  "53": "Bucket and Esther track Lady Dedlock through London's streets",
  "54": "Grandfather Smallweed attempts to blackmail the grieving Sir Leicester",
  "55": "Lady Dedlock flees in disguise through London's poorest areas",
  "56": "The desperate chase for Lady Dedlock reaches its climax",
  "57": "Esther finds her mother dead at the cemetery gates",
  "58": "Chesney Wold mourns as Sir Leicester grieves his wife's tragic death",
  "59": "Mr. Jarndyce reveals his selfless plan for Esther's true happiness",
  "60": "The Jarndyce lawsuit finally ends with nothing left for anyone",
  "61": "Richard is devastated as the lawsuit's hollow conclusion breaks him",
  "62": "Various plot threads are resolved in the aftermath",
  "63": "George remains loyally at Chesney Wold attending the declining Sir Leicester",
  "64": "Esther prepares to marry Woodcourt as Richard lies dying",
  "65": "Richard dies reconciled with Jarndyce, destroyed by the lawsuit",
  "66": "Chesney Wold stands empty and fading as the old aristocratic order passes",
  "67": "Seven years later, Esther reflects on her happy life and family at Bleak House"
}
